KAVATER/STM32-BLE/STM_Client/Core/Src/test.c
              /* search AD TYPE 0x09 (Complete Local Name) */
              /* search AD Type 0x02 (16 bits UUIDS) */
              /* ISOLATION OF BD ADDRESS AND LOCAL NAME */

              while(k < event_data_size)
              {
                adlength = adv_report_data[k];
                /* USER CODE BEGIN adlength_check */
                if (adlength == 0)
                {
                  break; /* malformed AD structure - stop instead of looping forever */
                }
                /* USER CODE END adlength_check */
                adtype = adv_report_data[k + 1];
                switch (adtype)
                {
                  case AD_TYPE_FLAGS: /* now get flags */
                    /* USER CODE BEGIN AD_TYPE_FLAGS */

                    /* USER CODE END AD_TYPE_FLAGS */
                    break;

                  case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                    /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */

                    /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
                    break;

                  case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
                    /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */

                    /* USER CODE END AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
                    if (adlength >= 7 && adv_report_data[k + 2] == 0x01)
                    { /* ST VERSION ID 01 */
                      APP_DBG_MSG("--- ST MANUFACTURER ID --- \n\r");
                      switch (adv_report_data[k + 3])
                      {   /* Demo ID */
                         case CFG_DEV_ID_P2P_SERVER1: /* End Device 1 */
                         APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n\r");
                         BleApplicationContext.DeviceServerFound = 0x01;
                         SERVER_REMOTE_ADDR_TYPE = report_addr_type;
                         memcpy(SERVER_REMOTE_BDADDR, report_addr, BD_ADDR_SIZE_LOCAL);
                         break;

                        default:
                          break;
                      }
                    }
                    break;

                  case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
                    /* USER CODE BEGIN AD_TYPE_SERVICE_DATA */

                    /* USER CODE END AD_TYPE_SERVICE_DATA */
                    break;

                  case AD_TYPE_COMPLETE_LOCAL_NAME:
                  case AD_TYPE_SHORTENED_LOCAL_NAME:
                    name_len = adlength - 1;
                    if (name_len > sizeof(local_name) - 1)
                    {
                      name_len = sizeof(local_name) - 1; /* avoid overflowing the buffer */
                    }
                    memcpy(local_name, &adv_report_data[k + 2], name_len);
                    local_name[name_len] = '\0';
                    break;

                  default:
                    /* USER CODE BEGIN adtype_default */

                    /* USER CODE END adtype_default */
                    break;
                } /* end switch adtype */
                k += adlength + 1;
              } /* end while */

              /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT_2 */
              /* Merge this report into the running, deduplicated device table
               * (keyed by BD address) and print it. A device typically shows up
               * across two separate reports - ADV_IND then SCAN_RSP - so this
               * keeps the RSSI/name from both in sync under one entry. */
              (void)BLE_UpdateDiscoveredDeviceList(report_addr, report_addr_type, rssi,
                                                    name_len ? local_name : NULL);
              /* USER CODE END EVT_LE_ADVERTISING_REPORT_2 */
            }
            break;

          /* USER CODE BEGIN META_EVT */

          /* USER CODE END META_EVT */

          default:
            /* USER CODE BEGIN subevent_default */

            /* USER CODE END subevent_default */
            break;
        }
      }
      break; /* HCI_LE_META_EVT_CODE */

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN evt_default */

      /* USER CODE END evt_default */
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status(uint16_t Connection_Handle)
{
  if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle == Connection_Handle)
  {
    return BleApplicationContext.Device_Connection_Status;
  }
  return APP_BLE_IDLE;
}
/* USER CODE BEGIN FD */

/* USER CODE END FD */
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *p_bd_addr;

  uint16_t a_appearance[1] = { BLE_CFG_GAP_APPEARANCE };
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  APP_DBG_MSG("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  ret = hci_reset();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : hci_reset command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: hci_reset command\n");
  }

  /**
   * Write the BD Address
   */
  p_bd_addr = BleGetBdAddress();
  ret = aci_hal_write_config_data(CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, CONFIG_DATA_PUBLIC_ADDRESS_LEN, (uint8_t*) p_bd_addr);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET, result: 0x%x \n", ret);
  }
   else
   {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBLIC_ADDRESS_OFFSET\n");
    APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
   }

  /**
   * Write Identity root key used to derive IRK and DHK(Legacy)
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)a_BLE_CfgIrValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
  }

  /**
   * Write Encryption root key used to derive LTK and CSRK
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)a_BLE_CfgErValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET\n");
  }

  /**
   * Set TX Power.
   */
  ret = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_set_tx_power_level command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_set_tx_power_level command\n");
  }

  /**
   * Initialize GATT interface
   */
  ret = aci_gatt_init();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gatt_init command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gatt_init command\n");
  }

  /**
   * Initialize GAP interface
   */
  role = 0;

