KAVATER/STM32-BLE/STM_Client/Core/Src/test.c
    }
    else
    {
      /* USER CODE BEGIN BLE_CONNECT_FAILED */

      /* USER CODE END BLE_CONNECT_FAILED */
      BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

    }
  }
  /* USER CODE BEGIN Connect_Request_2 */

  /* USER CODE END Connect_Request_2 */
  return;
}

static void Switch_OFF_GPIO()
{
  /* USER CODE BEGIN Switch_OFF_GPIO */

  /* USER CODE END Switch_OFF_GPIO */
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *p_otp_addr;
  const uint8_t *p_bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief  Find (or add) a discovered-device entry by BD address, update its
 *         RSSI, and merge in a decoded name if one was found in this report.
 *         Prints the (updated) entry to UART1 so you get a live list on boot.
 * @param  addr:      6-byte BD address from the advertising report
 * @param  addr_type: address type from the advertising report
 * @param  rssi:      RSSI decoded from this report
 * @param  name:      NUL-terminated name if one was parsed this report, else NULL
 * @retval index of the entry in the table, or -1 if the table is full
 */
static int BLE_UpdateDiscoveredDeviceList(const uint8_t *addr, uint8_t addr_type,
                                           int8_t rssi, const char *name)
{
  int i;
  int idx = -1;

  for (i = 0; i < NbDiscoveredDevices; i++)
  {
    if (memcmp(a_DiscoveredDevices[i].Address, addr, BD_ADDR_SIZE_LOCAL) == 0)
    {
      idx = i;
      break;
    }
  }

  if (idx < 0)
  {
    if (NbDiscoveredDevices >= MAX_DISCOVERED_DEVICES)
    {
      return -1; /* table full - drop silently rather than corrupt memory */
    }
    idx = NbDiscoveredDevices++;
    memcpy(a_DiscoveredDevices[idx].Address, addr, BD_ADDR_SIZE_LOCAL);
    a_DiscoveredDevices[idx].Address_Type = addr_type;
    a_DiscoveredDevices[idx].NameValid = 0;
    a_DiscoveredDevices[idx].Name[0] = '\0';
  }

  a_DiscoveredDevices[idx].Rssi = rssi;

  if (name != NULL)
  {
    strncpy(a_DiscoveredDevices[idx].Name, name, sizeof(a_DiscoveredDevices[idx].Name) - 1);
    a_DiscoveredDevices[idx].Name[sizeof(a_DiscoveredDevices[idx].Name) - 1] = '\0';
    a_DiscoveredDevices[idx].NameValid = 1;
  }

  printf("[%2d] %02X:%02X:%02X:%02X:%02X:%02X | RSSI %4d dBm | %s\r\n",
         idx,
         a_DiscoveredDevices[idx].Address[5], a_DiscoveredDevices[idx].Address[4],
         a_DiscoveredDevices[idx].Address[3], a_DiscoveredDevices[idx].Address[2],
         a_DiscoveredDevices[idx].Address[1], a_DiscoveredDevices[idx].Address[0],
         a_DiscoveredDevices[idx].Rssi,
         a_DiscoveredDevices[idx].NameValid ? a_DiscoveredDevices[idx].Name : "(no name)");

  return idx;
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  return;
}

void hci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

static void BLE_UserEvtRx(void * pPayload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *pParam;

  pParam = (tHCI_UserEvtRxParam *)pPayload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    pParam->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    pParam->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t status)
{
  uint32_t task_id_list;
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      break;

    default:
      break;
  }
  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();
  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
